*PROCESS LIMITS(EXTNAME(8));
 DKR12345
 : PROC(MSG)   OPTIONS(FETCHABLE)  RETURNS(CHAR(36));
 DCL  MSG  CHAR(16);
 DCL  RET  CHAR (36);
     RET =  MSG !! ' NTABIŸ‘œ’';
     RETURN(RET);
 END  DKR12345 ;
